//Objects

(function(objects) {

    //5.1 english
    //Создать объект, описывающий автомобиль (производитель, модель, год выпуска, средняя скорость), и следующие функции для работы с этим объектом:
    //Функция для вывода на экран информации об автомобиле;
    //Функция для подсчета необходимого времени для преодоления переданного расстояния со средней скоростью. Учтите, что через каждые 4 часа дороги водителю необходимо делать перерыв на 1 час.
    const firstSectionFirstBtn = document.getElementById("task1.1");
    firstSectionFirstBtn.addEventListener("click", () => {});

    //5.2 english
    //Создать объект, хранящий в себе отдельно числитель и знаменатель дроби, и следующие функции для работы с этим объектом: 
    //Функция сложения 2-х объектов-дробей;
    //Функция вычитания 2-х объектов-дробей;
    //Функция умножения 2-х объектов-дробей;
    //Функция деления 2-х объектов-дробей;
    //Функция сокращения объекта-дроби.
    const firstSectionSecondBtn = document.getElementById("task1.2");
    firstSectionSecondBtn.addEventListener("click", () => {});

    //5.3 english
    //Создать объект, описывающий время (часы, минуты, секунды), и следующие функции для работы с этим объектом: 
    //Функция вывода времени на экран;
    //Функция изменения времени на переданное количество секунд;
    //Функция изменения времени на переданное количество минут;
    //Функция изменения времени на переданное количество часов. 
    //Учтите, что в последних 3-х функциях, при изменении одной части времени, может измениться и другая. Например, если ко времени «20:30:45» добавить 30 секунд, то должно получиться «20:31:15», а не «20:30:75».
    const firstSectionThirdBtn = document.getElementById("task1.3");
    firstSectionThirdBtn.addEventListener("click", () => {});
})();
//Objects End